In [2]:
import pandas as pd
import psycopg2
import urllib.parse
from sqlalchemy import create_engine

password = urllib.parse.quote_plus("@Woodlandscollege7696")
engine = create_engine(f'postgresql://postgres:{password}@localhost/postgres')

def get_connection():
    return psycopg2.connect(
        host = "localhost",
        database = "postgres",
        password = "@Woodlandscollege7696",
        user = "postgres"
        )

In [3]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute('''
        CREATE TABLE IF NOT EXISTS EMPLOYEES (
        EM_ID INTEGER PRIMARY KEY,
        FIRST_NAME VARCHAR(30),
        LAST_NAME VARCHAR(30),
        JOB_ID INTEGER,
        JOB_TITLE VARCHAR(30))
        ''')

In [4]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute('''
        CREATE PROCEDURE add_employee (IN EM_ID INTEGER, IN FIRST_NAME TEXT, IN LAST_NAME TEXT, IN JOB_ID INTEGER, IN JOB_TITLE TEXT)
        LANGUAGE PLPGSQL
        AS $$
        BEGIN
            INSERT INTO EMPLOYEES(EM_ID, FIRST_NAME, LAST_NAME, JOB_ID, JOB_TITLE)
            VALUES (EM_ID, FIRST_NAME, LAST_NAME, JOB_ID, JOB_TITLE);
        END;
        $$
        ''')

DuplicateFunction: function "add_employee" already exists with same argument types

In [25]:
EMPLOYEES = pd.read_sql_query('SELECT * FROM EMPLOYEES', engine)
EMPLOYEES.head()

   em_id first_name last_name  job_id                  job_title
0      1     Daniel   Lawless       1  Machine Learning Engineer
1      2     Dennis   Lawless       2                     Barber
2      5     Gerard  Flawless       9                       Hair

In [24]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute('''
        CALL add_employee(5, 'Gerard', 'Flawless', 9, 'Hair')
        ''')

In [23]:
# ACID transactions. Using the with .. as statements, it automatically COMMIT if all SQL statement are successful and automatically ROLLBACK is one or more SQL statement are unsuccessfull.

def transfer_and_update():
    try:
        with get_connection() as conn:          # commits/rolls back automatically
            with conn.cursor() as cur:
                cur.execute("""

                    BEGIN

                    UPDATE BankAccounts
                    SET Balance = Balance - 200
                    WHERE AccountName = 'Rose';

                    UPDATE BankAccounts
                    SET Balance = Balance + 200
                    WHERE AccountName = 'Shoe Shop';

                    UPDATE ShoeShop
                    SET Stock = Stock - 1
                    WHERE Product = 'Boots';
                """)
        # If we get here, commit has already happened
        print("✔ Transaction committed.")
    except Exception as err:
        # Connection context manager will already have rolled back
        print("✖ Transaction rolled back due to:", err)

In [7]:
PETSALE = pd.read_sql_query("SELECT * FROM PETSALE", engine)
PETSALE.head()

   id    animal  saleprice    saledate  quantity
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24

In [36]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute("""
            CREATE PROCEDURE delete_table(IN table_name TEXT)
            LANGUAGE PLPGSQL
            AS $$
            BEGIN
                EXECUTE format('DROP TABLE IF EXISTS', table_name);
            END
            $$
        """)

In [38]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute("""
            CREATE PROCEDURE delete_view(IN view_name TEXT)
            LANGUAGE PLPGSQL
            AS $$
            BEGIN
                EXECUTE format('DROP VIEW IF EXISTS', view_name);
            END
            $$
        """)

In [114]:
PETSALE = pd.read_sql_query("""
    SELECT * FROM PETSALE
""", engine)

PETSALE.head()

   id    animal  saleprice    saledate  quantity
0   3    Parrot      50.00  2018-06-04         2
1   4   Hamster      60.60  2018-06-11         6
2   5  Goldfish      48.48  2018-06-14        24
3   1       Cat     337.57  2018-05-29         9
4   2       Dog     187.50  2018-06-01         3

In [110]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute("""
            CREATE PROCEDURE UPDATE_SALEPRICE(IN Animal_ID INTEGER, IN Animal_health VARCHAR(5))
            LANGUAGE PLPGSQL
            AS $$
            BEGIN
                IF LOWER(Animal_health) = 'bad' THEN
                    UPDATE PETSALE
                    SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.25)
                    WHERE ID = Animal_ID;
                ELSIF LOWER(Animal_Health) = 'worse' THEN
                    UPDATE PETSALE
                    SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.5)
                    WHERE ID = Animal_ID;
                ELSE
                    UPDATE PETSALE
                    SET SALEPRICE = SALEPRICE
                    WHERE ID = Animal_ID;
                END IF;
            END
            $$
        """)

        # END IF ends the IF statement

In [113]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute("""
        CALL UPDATE_SALEPRICE(2, 'BAD')
        """)

In [109]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute("""
        DROP PROCEDURE UPDATE_SALEPRICE""")